IDEA Open Model
RigidLink.RigidX Property
Compatible with IDEA StatiCa v 10.1
 DOF rigid in X dirrection
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.0.1 (10.1.0.1)
Syntax
public bool RigidX { get; set; }
Public Property RigidX As Boolean
	Get
	Set
public:
property bool RigidX {
	bool get ();
	void set (bool value);
}
Property Value
Type: Boolean
See Also
Reference
RigidLink Class
IdeaRS.OpenModel.Model Namespace